Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [3]:
import pandas as pd
import numpy as np

In [5]:
pd.Series(42, index=[4,8,15,16,23])

4     42
8     42
15    42
16    42
23    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [6]:
import pandas as pd

In [8]:
df1 =pd.Series(range(10))

In [10]:
print(df1)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:    
Then, print the DataFrame.

In [17]:
import pandas as pd

# DICTIONARY OF LIST
dict = {'Name': ['Alice' ,'Bob' , 'Claire'],
        'Age' :[ 25 , 30 , 27 ],
        'Gender': ['Female' , 'Male' , 'Female']}

In [19]:
df3 = pd.DataFrame(dict)

In [20]:
print(df3)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [ ]:
DataFrame is a 2-dimensional labeled data structure with columns of potentially different type.
The diff() function is used to first discrete difference of element.

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [29]:
import pandas as pd
df6 = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [30]:
df6.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [31]:
df6['Embarked']

0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: Embarked, Length: 891, dtype: object

In [32]:
df6[['Fare', 'Cabin', 'Embarked']]

        Fare Cabin Embarked
0     7.2500   NaN        S
1    71.2833   C85        C
2     7.9250   NaN        S
3    53.1000  C123        S
4     8.0500   NaN        S
..       ...   ...      ...
886  13.0000   NaN        S
887  30.0000   B42        S
888  23.4500   NaN        S
889  30.0000  C148        C
890   7.7500   NaN        Q

[891 rows x 3 columns]

In [33]:
type(df6['Embarked'])

pandas.core.series.Series

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [ ]:
Python has both mutable and immutable collection data types. 
Strings and tuples are immutable, while lists, dictionaries, and sets are mutable.
Panel: It is a 3-D, size-mutable array.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [5]:
import pandas as pd

data = {'Name': ['John', 'Jane', 'Jim', 'Joan'],
       'Age': [25, 30, 35, 40],
       'Occupation': ['Engineer', 'Doctor', 'Teacher', 'Lawyer'],
       'Number' : [222,444,666,456],
       'Height' : [6-2 , 6-3 ,6-5 ,6-8],
       'Marks' : [90, 70 ,85 ,65] }

In [8]:
df5 =pd.DataFrame(data)

In [10]:
df5.columns

Index(['Name', 'Age', 'Occupation', 'Number', 'Height', 'Marks'], dtype='object')

In [13]:
df5['Occupation']

0    Engineer
1      Doctor
2     Teacher
3      Lawyer
Name: Occupation, dtype: object

In [14]:
df5[['Occupation','Name', 'Age']]

  Occupation  Name  Age
0   Engineer  John   25
1     Doctor  Jane   30
2    Teacher   Jim   35
3     Lawyer  Joan   40

In [15]:
df5.head

<bound method NDFrame.head of    Name  Age Occupation  Number  Height  Marks
0  John   25   Engineer     222       4     90
1  Jane   30     Doctor     444       3     70
2   Jim   35    Teacher     666       1     85
3  Joan   40     Lawyer     456      -2     65>

In [16]:
df5.head(3)

   Name  Age Occupation  Number  Height  Marks
0  John   25   Engineer     222       4     90
1  Jane   30     Doctor     444       3     70
2   Jim   35    Teacher     666       1     85

In [17]:
df5.tail

<bound method NDFrame.tail of    Name  Age Occupation  Number  Height  Marks
0  John   25   Engineer     222       4     90
1  Jane   30     Doctor     444       3     70
2   Jim   35    Teacher     666       1     85
3  Joan   40     Lawyer     456      -2     65>

In [18]:
df5.tail(2)

   Name  Age Occupation  Number  Height  Marks
2   Jim   35    Teacher     666       1     85
3  Joan   40     Lawyer     456      -2     65